# Scraping table from website

In [1]:
import requests 
import pandas as pd 
from bs4 import BeautifulSoup

In [2]:
url = 'https://ticker.finology.in/'
r = requests.get(url)
print(r.status_code)

200

In [3]:
soup = BeautifulSoup(r.text,"lxml")

In [4]:
table = soup.find("table",class_="table table-sm table-hover screenertable")
#print(table)

### Obtain the headers from the table

In [5]:
headers = table.find_all("th")### th = table headers 
print(headers)

[<th scope="col">Company</th>, <th scope="col">Price<span class="muted">Rs.</span></th>, <th scope="col">Day High<span class="muted">Rs.</span></th>]

In [6]:
for i in headers:
    print(i.text)

Company
PriceRs.
Day HighRs.

## Save the header in the titles

In [7]:
titles = []

for i in headers:
    title = i.text
    titles.append(title)
    
print(titles)

['Company', 'PriceRs.', 'Day HighRs.']

In [8]:
df = pd.DataFrame(columns=titles)
print(df)

Empty DataFrame
Columns: [Company, PriceRs., Day HighRs.]
Index: []

## Obtain data from table

In [9]:
rows = table.find_all("tr")
#print(rows)

In [10]:
for i in rows[1:] : #[1:] is used to skip the header row ## We skip 0 here bcuz we already obtain it in table head 
    print(i.text)
## We need to store the output it in respective heads

Larsen & Toubro

3763.90
3813.35



Maruti Suzuki

12600.35
12726.80



Sun Pharma Inds.

1620.55
1634.00



Indus Towers

291.15
292.75



Century Textile &Ind

1629.90
1684.90



Adani Ports &Special

1341.85
1358.70



ABB India

6360.85
6471.95



Grasim Industries

2287.30
2309.20



Avenue Supermarts

4525.60
4560.00



Interglobe Aviation

3548.65
3573.80



Info Edge

5592.00
5631.80



Chalet Hotels

883.30
958.00



Cummins India

3006.25
3025.00



Oracle Finl. Service

8774.10
8894.00



Siemens

5374.05
5405.00

In [11]:
for i in rows[1:]:
    data = i.find_all("td")
    #print(data)
    row = [j.text for j in data]
    #print(row)
    l = len(df)
    df.loc[l] = row
    
print(df)

                     Company  PriceRs. Day HighRs.
0        \nLarsen & Toubro\n   3763.90     3813.35
1          \nMaruti Suzuki\n  12600.35    12726.80
2       \nSun Pharma Inds.\n   1620.55     1634.00
3           \nIndus Towers\n    291.15      292.75
4   \nCentury Textile &Ind\n   1629.90     1684.90
5   \nAdani Ports &Special\n   1341.85     1358.70
6              \nABB India\n   6360.85     6471.95
7      \nGrasim Industries\n   2287.30     2309.20
8      \nAvenue Supermarts\n   4525.60     4560.00
9    \nInterglobe Aviation\n   3548.65     3573.80
10             \nInfo Edge\n   5592.00     5631.80
11         \nChalet Hotels\n    883.30      958.00
12         \nCummins India\n   3006.25     3025.00
13  \nOracle Finl. Service\n   8774.10     8894.00
14               \nSiemens\n   5374.05     5405.00

In [12]:
# Initialize an empty list to hold rows
rows_data = []

# Iterate over each row
for i in rows[1:]:
    data = i.find_all("td")
    row = [j.text for j in data]
    rows_data.append(row)

# Create DataFrame from the list of rows
try:
    df = pd.DataFrame(rows_data,columns=titles)
except Exception as e:
    print("Error occurred while creating DataFrame:", e)

print(df)

                     Company  PriceRs. Day HighRs.
0        \nLarsen & Toubro\n   3763.90     3813.35
1          \nMaruti Suzuki\n  12600.35    12726.80
2       \nSun Pharma Inds.\n   1620.55     1634.00
3           \nIndus Towers\n    291.15      292.75
4   \nCentury Textile &Ind\n   1629.90     1684.90
5   \nAdani Ports &Special\n   1341.85     1358.70
6              \nABB India\n   6360.85     6471.95
7      \nGrasim Industries\n   2287.30     2309.20
8      \nAvenue Supermarts\n   4525.60     4560.00
9    \nInterglobe Aviation\n   3548.65     3573.80
10             \nInfo Edge\n   5592.00     5631.80
11         \nChalet Hotels\n    883.30      958.00
12         \nCummins India\n   3006.25     3025.00
13  \nOracle Finl. Service\n   8774.10     8894.00
14               \nSiemens\n   5374.05     5405.00

In [13]:
df['Company'] = df.Company.str.replace('\n','')
df

                 Company  PriceRs. Day HighRs.
0        Larsen & Toubro   3763.90     3813.35
1          Maruti Suzuki  12600.35    12726.80
2       Sun Pharma Inds.   1620.55     1634.00
3           Indus Towers    291.15      292.75
4   Century Textile &Ind   1629.90     1684.90
5   Adani Ports &Special   1341.85     1358.70
6              ABB India   6360.85     6471.95
7      Grasim Industries   2287.30     2309.20
8      Avenue Supermarts   4525.60     4560.00
9    Interglobe Aviation   3548.65     3573.80
10             Info Edge   5592.00     5631.80
11         Chalet Hotels    883.30      958.00
12         Cummins India   3006.25     3025.00
13  Oracle Finl. Service   8774.10     8894.00
14               Siemens   5374.05     5405.00